; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 77342 2 3 2 6 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph0 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star4)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(have_image Star6 thermograph0)
	(have_image Star7 thermograph0)
	(have_image Phenomenon8 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (turn_to satellite1 groundstation2 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 3
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 3
4. (turn_to satellite0 phenomenon8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon8)
   goals met: 0 of 3
5. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 3
6. (turn_to satellite0 star4 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star4)
   goals met: 0 of 3
7. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 0 of 3
8. (turn_to satellite1 phenomenon8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 3
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
10. (take_image satellite1 phenomenon8 instrument2 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 1 of 3
11. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 1 of 3
12. (turn_to satellite1 star7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star7)
   goals met: 1 of 3
13. (turn_to satellite0 star7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star7)
   goals met: 1 of 3
14. (take_image satellite0 star7 instrument0 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 2 of 3
15. (turn_to satellite1 star6 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star6)
   goals met: 2 of 3
16. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 2 of 3
17. (take_image satellite1 star6 instrument2 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 3 of 3
